tutorials/heatTransfer/chtMultiRegionFoam/solarBeamWithTrees/system/extrudeToRegionMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeToRegionMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

region          floor;

faceZones       (floor_zone);

oneD            false;

sampleMode      nearestPatchFace;

oneDPolyPatchType empty; //wedge

extrudeModel    linearNormal;

nLayers         5;

expansionRatio  1;

adaptMesh       true; // mapped for both

linearNormalCoeffs
{
    thickness       1;
}


// ************************************************************************* //
